<?php

namespace App\Http\Controllers;

use App\Http\Requests\Guest\IndexRequest;
use App\Http\Requests\Guest\StoreRequest;
use App\Http\Requests\Guest\UpdateRequest;
use App\Http\Resources\GuestResource;
use App\Models\Guest;
use libphonenumber\PhoneNumberUtil;

class GuestController extends Controller
{
    private $countryNameByCode = ['1' => 'США', '1242' => 'Багамские Острова', '1246' => 'Барбадос', '1264' => 'Ангилья', '1268' => 'Антигуа и Барбуда', '1284' => 'Британские Виргинские острова', '1340' => 'Американские Виргинские острова', '1345' => 'Каймановы острова', '1441' => 'Бермудские острова', '1473' => 'Гренада', '1649' => 'Тёркс и Кайкос', '1664' => 'Монтсеррат', '1670' => 'Северные Марианские острова Сайпан', '1671' => 'Гуам', '1684' => 'Американское Самоа', '1721' => 'Синт-Маартен', '1758' => 'Сент-Люсия', '1767' => 'Доминика', '1784' => 'Сент-Винсент и Гренадины', '1787' => 'Пуэрто-Рико', '1809' => 'Доминиканская Республика', '1829' => 'Доминиканская Республика', '1849' => 'Доминиканская Республика', '1868' => 'Тринидад и Тобаго', '1869' => 'Сент-Китс и Невис', '1876' => 'Ямайка', '1939' => 'Пуэрто-Рико', '20' => 'Египет', '211' => 'Южный Судан', '212' => 'Марокко', '213' => 'Алжир', '216' => 'Тунис', '218' => 'Ливия', '220' => 'Гамбия', '221' => 'Сенегал', '222' => 'Мавритания', '223' => 'Мали', '224' => 'Гвинея', '225' => 'Кот-д’Ивуар', '226' => 'Буркина Фасо', '227' => 'Нигер', '228' => 'Того', '229' => 'Бенин', '230' => 'Маврикий', '231' => 'Либерия', '232' => 'Сьерра-Леоне', '233' => 'Гана', '234' => 'Нигерия', '235' => 'Чад', '236' => 'Центральноафриканская Республика', '237' => 'Камерун', '238' => 'Кабо-Верде', '239' => 'Сан-Томе и Принсипи', '240' => 'Экваториальная Гвинея', '241' => 'Габон', '242' => 'Конго', '243' => 'Дем. Респ. Конго (Киншаса)', '244' => 'Ангола', '245' => 'Гвинея-Бисау', '246' => 'Диего-Гарсия', '247' => 'Остров', '248' => 'Сейшелы', '249' => 'Судан', '250' => 'Руанда', '251' => 'Эфиопия', '252' => 'Сомали', '253' => 'Джибути', '254' => 'Кения', '255' => 'Танзания', '256' => 'Уганда', '257' => 'Бурунди', '258' => 'Мозамбик', '260' => 'Замбия', '261' => 'Мадагаскар', '262' => 'Реюньон', '263' => 'Зимбабве', '264' => 'Намибия', '265' => 'Малави', '266' => 'Лесото', '267' => 'Ботсвана', '268' => 'Свазиленд', '269' => 'Коморы', '27' => 'Южно-Африканская Респ.', '290' => 'Остров Святой', '291' => 'Эритрея', '297' => 'Аруба', '298' => 'Фарерские острова', '299' => 'Гренландия', '30' => 'Греция', '31' => 'Нидерланды', '32' => 'Бельгия', '33' => 'Франция', '34' => 'Испания', '350' => 'Гибралтар', '351' => 'Португалия', '352' => 'Люксембург', '353' => 'Ирландия', '354' => 'Исландия', '355' => 'Албания', '356' => 'Мальта', '357' => 'Кипр', '358' => 'Финляндия', '35818' => 'Аланды', '359' => 'Болгария', '36' => 'Венгрия', '370' => 'Литва', '371' => 'Латвия', '372' => 'Эстония', '373' => 'Молдова', '374' => 'Армения', '37447' => 'Нагорный Карабах', '375' => 'Белоруссия', '376' => 'Андорра', '377' => 'Монако', '378' => 'Сан-Марино', '380' => 'Украина', '381' => 'Сербия', '382' => 'Черногория', '385' => 'Хорватия', '386' => 'Словения', '387' => 'Босния и Герцеговина', '389' => 'Респ. Македония', '39' => 'Италия', '3906698' => 'Ватикан', '40' => 'Румыния', '41' => 'Швейцария', '420' => 'Чехия', '421' => 'Словакия', '423' => 'Лихтенштейн', '43' => 'Австрия', '44' => 'Великобритания', '441481' => 'Гернси', '441534' => 'Джерси', '441624' => 'Остров Мэн', '4428' => 'Северная Ирландия', '45' => 'Дания', '46' => 'Швеция', '47' => 'Норвегия', '48' => 'Польша', '49' => 'Германия', '500' => 'Фолклендские острова', '501' => 'Белиз', '502' => 'Гватемала', '503' => 'Сальвадор', '504' => 'Гондурас', '505' => 'Никарагуа', '506' => 'Коста-Рика', '507' => 'Панама', '508' => 'Сен-Пьер и Микелон', '509' => 'Гаити', '51' => 'Перу', '52' => 'Мексика', '53' => 'Куба', '54' => 'Аргентина', '55' => 'Бразилия', '56' => 'Чили', '57' => 'Колумбия', '58' => 'Венесуэла', '590' => 'Гваделупа', '591' => 'Боливия', '592' => 'Гайана', '593' => 'Эквадор', '594' => 'Фр. Гвиана', '595' => 'Парагвай', '596' => 'Мартиника', '597' => 'Суринам', '598' => 'Уругвай', '599' => 'Карибского бассейна', '60' => 'Малайзия', '61' => 'Австралия', '6189162' => 'Кокосовые острова', '6189164' => 'Остров Рождества', '62' => 'Индонезия', '63' => 'Филиппины', '64' => 'Новая Зеландия', '65' => 'Сингапур', '66' => 'Таиланд', '670' => 'Восточный Тимор', '6721' => 'Австралийская антарктическая база', '6723' => 'Норфолк (остров)', '673' => 'Бруней-Даруссалам', '674' => 'Науру', '675' => 'Папуа-Новая Гвинея', '676' => 'Тонга', '677' => 'Соломоновы Острова', '678' => 'Вануату', '679' => 'Фиджи', '680' => 'Палау', '681' => 'Уоллис и Футуна', '682' => 'Острова Кука', '683' => 'Ниуэ', '685' => 'Самоа', '686' => 'Кирибати', '687' => 'Новая Каледония', '688' => 'Тувалу', '689' => 'Французская Полинезия (Таити)', '690' => 'Токелау', '691' => 'Ф.Ш. Микронезии', '692' => 'Маршалловы Острова', '7' => 'Россия', '7840' => 'Абхазия', '81' => 'Япония', '82' => 'Южная Корея', '84' => 'Вьетнам', '850' => 'Северная Корея', '852' => 'Гонконг', '853' => 'Макао', '855' => 'Камбоджа', '856' => 'Лаос', '86' => 'Китай', '880' => 'Бангладеш', '886' => 'Тайвань', '90' => 'Турция', '90392' => 'Северный Кипр', '91' => 'Индия', '92' => 'Пакистан', '93' => 'Афганистан', '94' => 'Шри-Ланка', '95' => 'Бирма (Мьянма)', '960' => 'Мальдивские острова', '961' => 'Ливан', '962' => 'Иордания', '963' => 'Сирия', '964' => 'Ирак', '965' => 'Кувейт', '966' => 'Саудовская Аравия', '967' => 'Йемен', '968' => 'Оман', '970' => 'Палестина', '971' => 'Объединенные Арабские Эмираты', '972' => 'Израиль', '973' => 'Бахрейн', '974' => 'Катар', '975' => 'Бутан', '976' => 'Монголия', '977' => 'Непал', '98' => 'Иран', '992' => 'Таджикистан', '993' => 'Туркменистан', '994' => 'Азербайджан', '995' => 'Грузия', '996' => 'Киргизия', '9971' => 'Южная Осетия', '998' => 'Узбекистан',];

    private function getCountryNameByCode($countryCode)
    {
        $name = null;

        if (isset($this->countryNameByCode[$countryCode])) {
            $name = $this->countryNameByCode[$countryCode];
        }

        return $name;
    }

    /**
     * Display a listing of the resource.
     */
    public function index(IndexRequest $request)
    {
        $data = $request->validated();
        $page = $data['page'] ?? 1;
        $perPage = $data['per_page'] ?? 10;
        $guests = Guest::paginate($perPage, ['*'], 'page', $page);

        return GuestResource::collection($guests);
    }

    /**
     * Store a newly created resource in storage.
     */
    public function store(StoreRequest $request)
    {
        $data = $request->validated();

        if (!isset($data['country'])) {
            $phoneUtil = PhoneNumberUtil::getInstance();
            try {
                $phoneObj = $phoneUtil->parse('+' . $data['phone']);
                $data['country'] = $this->getCountryNameByCode($phoneObj->getCountryCode());
            } catch (\Exception $e) {
                $data['country'] = null;
            }
        }

        $guest = Guest::create($data);

        return new GuestResource($guest);
    }

    /**
     * Display the specified resource.
     */
    public function show(Guest $guest)
    {
        return new GuestResource($guest);
    }

    /**
     * Update the specified resource in storage.
     */
    public function update(UpdateRequest $request, Guest $guest)
    {
        $data = $request->validated();
        $guest->update($data);

        return new GuestResource($guest);
    }

    /**
     * Remove the specified resource from storage.
     */
    public function destroy(Guest $guest)
    {
        return $guest->delete();
    }
}
